Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииБитрикса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СостояниеЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗамера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Производство</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроизводства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачинатьЧерез</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСотрудников</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приоритеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Помещения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем стНачальныеЗначения;

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменилосьПомещение",Новый Структура("Помещение,Проект",Объект.Ссылка,Объект.Проект),ЭтаФорма);
	
	ВыгружатьВБитрикс = Ложь;
	
	Если НЕ (стНачальныеЗначения.Проект = Объект.Проект И стНачальныеЗначения.Наименование = Объект.Наименование) Тогда
		Если ЗначениеЗаполнено(Объект.Проект) Тогда
			ПроверитьКаталогИзделия(Объект.Проект,Объект.Ссылка);	
		КонецЕсли;
		ВыгружатьВБитрикс = Истина;
	КонецЕсли;
	
	Если ВыгружатьВБитрикс Тогда
	
		ВыгрузитьНаСервереВБитрикс();		
	
	КонецЕсли;
КонецПроцедуры 

Процедура ВыгрузитьНаСервереВБитрикс()

	УстановитьПривилегированныйРежим(Истина);
	
	текОбъект = РеквизитФормыВЗначение("Объект");
	
	Отказ = Ложь;
	Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(текОбъект, Ложь, Отказ);

КонецПроцедуры // ВыгрузитьНаСервереВБитрикс()

&НаСервереБезКонтекста
Процедура ПроверитьКаталогИзделия(ОбъектПомещение,СсылкаНаПомещения)

	Справочники.Помещения.ПроверитьКаталогИзделия(ОбъектПомещение,СсылкаНаПомещения);		

КонецПроцедуры // ПроверитьРасположениеОбъекта()
 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Объект") Тогда
		Объект.Объект = Параметры.Объект;
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ПолучитьИзделиеКомплект();
		ПолучитьДатуПриемки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = ПолучитьНаименованиеПомещения(Объект.Проект, СокрЛП(Объект.НомерПомещения), СокрЛП(Объект.НаименованиеБезКода));
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНаименованиеПомещения(Сделка, НомерПомещения, НаименованиеБезКода)

	Возврат Справочники.Помещения.ПолучитьНаименованиеПомещения(Сделка,,НомерПомещения,НаименованиеБезКода);	

КонецФункции // ПолучитьНомерСделки()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	стНачальныеЗначения = Новый Структура("Наименование,Проект"
										,Объект.Наименование
										,Объект.Проект);
КонецПроцедуры    
									

Функция ПолучитьДатуПриемки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗамера.ОбъектИзменения КАК Документ,
		|	СостояниеЗамера.Период КАК Дата,
		|	СостояниеЗамера.СтатусЗамера КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
		|ГДЕ
		|	СостояниеЗамера.ОбъектЗамера = &Помещение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Помещение", Объект.Ссылка);
	
	Замеры.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ПолучитьИзделиеКомплект()
									
Функция ПолучитьИзделиеКомплект()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Основное КАК Основной,
		|	ИзделияКомплектИзделияЭлемент.Ссылка.НаименованиеКомплекта КАК ИзделиеКомплектНаименование,
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК ИзделиеКомплект,
		|	ИзделияКомплектИзделияЭлемент.Ссылка.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения = &Помещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Основное УБЫВ,
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения.Наименование";
	
	Запрос.УстановитьПараметр("Помещения", Объект.Ссылка);
	
		ЭтаФорма.тзКомплекты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ПолучитьИзделиеКомплект()

&НаКлиенте
Процедура тзКомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
									
&НаКлиенте
Процедура тзКомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзКомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элементы.тзКомплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.тзКомплекты.ТекущийЭлемент.Имя = "тзКомплектыГабаритныйЧертеж" Тогда
		ПоказатьЗначение(, ТД.ГабаритныйЧертеж);
	Иначе	
		ПоказатьЗначение(, ТД.ИзделиеКомплект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
